Revit 2027 API
BuiltInFailures.RevisionCloudFailures Class
 Failures about RevisionCloud.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.RevisionCloudFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class RevisionCloudFailures
Public NotInheritable Class RevisionCloudFailures
public ref class RevisionCloudFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type RevisionCloudFailures = class end
The BuiltInFailures.RevisionCloudFailures type exposes the following members.
Properties
Name | Description
ModifyingIssuedRevisionCloudOnUpgrade |  During upgrade, an issued revision cloud was moved. Please double check the revision cloud to ensure it is located in the correct place.
ProhibitCreationInIssued |  The most current project revision has been issued. No new revision clouds can be created in it. Please add a new revision to the global revision table.
ProhibitModificationOfIssuedRevisionCloud |  Issued Revision Clouds can't be modified.
ProhibitSwitchFromIssuedRevision |  Can't remove cloud from an Issued Revision.
ProhibitSwitchToIssuedRevision |  Can't add cloud to an Issued Revision.
Top
See Also
Reference
Autodesk.Revit.DB Namespace